Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K41.tmx
Source language: en_us
Languages: zh_cn

source: Fish Story
zh_cn: 鱼的故事

source: IN THE EARLY 1960s my parents ran a service station about 60 miles west of Fort Worth.
zh_cn: 20世纪60年代初，我父母在沃思堡市（Fort Worth）以西约60英里的地方开了一个加油站。

source: The gas station was in the middle of the country, along a reddish, gravelly, rutted road, on the way to nowhere.
zh_cn: 这个加油站位于所在村子的中心，沿边是一条浅红色的碎石公路，路面留有凹凸不平的车辙，不知通向何方。

source: You could see someone coming from a long way off.
zh_cn: 你会看到有人远远地过来。

source: Pumping gas was a hard way to make a living, and my father was never shy about reminding me about this.
zh_cn: 通过加油谋生非常艰难，但我父亲从不怯于向我提起这事。

source: Always waiting.
zh_cn: 加油就是要一直等待着。

source: When I was 10 years old one of my father's customers had caught a big catfish on a weekend trip to the Colorado River.
zh_cn: 我10岁那年，父亲的一位顾客周末在科罗拉多河（the Colorado River）度假时捉到了一条大鲶鱼。

source: It weighed 86 pounds, a swollen, gasping, grotesque netherworld creature pulled writhing and fighting up into the bright, hot, dusty world above.
zh_cn: 这条鱼有86磅重，鼓胀鼓胀的、扑哧作响，它是地下世界的生物，被拖上光明炎热、满是尘土的地面时不停地翻腾、拼命挣扎。

source: The man had brought the fish, wrapped in wet burlap, all the way out to my father's service station in the back of his car.
zh_cn: 那位男顾客用湿麻袋裹起鱼，放在车尾，一路驶向我爸的加油站，把鱼带了过来。

source: We were to have a big barbecue that weekend, and I was given the job of keeping the fish watered and alive until the time came to kill and cook it.
zh_cn: 那个周末我们打算吃烧烤大餐，我的任务是不停地给鱼加水，让它在被杀来做菜之前还活蹦乱跳。

source: All day long that Friday - in late August, school had not yet started - I knelt beside the gasping fish and kept it hosed down with a trickle of cool water, giving the fish life one silver gasp at a time, keeping its gills and its slick gray skin wet: the steady trickling of that hose, and nothing else, helping it stay alive.
zh_cn: 那是八月底的一个星期五，学校还没有开学，我成天跪在那条扑哧的鱼旁，不停地用软管往它身上浇冷水，让它暂时死不了，仍然在闪着银光的水流下扑哧作响，让它的鱼鳃、灰色滑溜的鱼皮保持湿润：其实也没别的什么事，不过是让软管持续不断地放出细细流水，保持鱼鲜活而已。

source: We had no tub large enough to hold the fish, and so I squatted beside it in the dust, resting on my heels, and studied it as I moved the silver stream of water up and down its back.
zh_cn: 我们的盆子不够大，装不下那条鱼，于是我就踮着脚跟，蹲在地上，守在鱼旁看着，把闪着银光的水流往鱼脊上来回浇洒。

source: The fish, in turn, studied me with its round, obsidian eyes, which had a gold lining to their perimeter, like pyrite.
zh_cn: 那条鱼反过来也用它那圆圆的黑曜石般的眼睛打量着我，它的眼圈是金黄色的，就像黄铁矿的颜色。

source: The fish panted and watched me while the heat built all around us, rising steadily through the day from the fields, giving birth in the summer-blue sky to towering white cumulus clouds.
zh_cn: 那条鱼边盯着我边扑哧扑哧喷气，当时我被热气包围着，热气从田间蒸腾，从早到晚都不曾减弱，夏日的蓝天也因此积聚了一层层厚厚的白云。

source: I grew dizzy in the heat, and from the strange combination of the unblinking monotony and utter fascination of my task, until the trickling from my hose seemed to be inflating those clouds - I seemed to be watering those clouds as one would water a garden.
zh_cn: 在炎炎夏日里，我做的事就是一眼都不眨地盯着，搞得头晕眼花，但不可思议的是，我对此又非常着迷，后来我用软管浇出涓涓细流时，觉得自己仿佛在让云朵膨胀，就像别人浇灌花园一样在浇灌云朵。

source: Do you ever think that those days were different - that we had more time for such thoughts, that time had not yet been corrupted? I am speaking less of childhood than of the general nature of the world we are living in.
zh_cn: 你是否曾想到那些与众不同的日子，那些有更多时间可以这样想象的日子，那些依旧纯洁的时光？我常常提及我们现世中的常见事物，而很少提及童年生活。

source: If you are the age I am now - mid-50s - then maybe you know what I mean.
zh_cn: 如果你和我一样现在已经55岁了，你可能就会明白我的意思。

source: The water pooled and spread across the gravel parking lot before running in wandering rivulets out into the field beyond, where bright butterflies swarmed and fluttered, dabbing at the mud I was making.
zh_cn: 水先积成一滩，然后向碎石铺就的停车场散去，最后形成几条弯弯的细流，一直流向远处的田里。田间的蝴蝶成群结对、欢快地飞来飞去，轻轻地落在我堆的泥土上。

source: Throughout the afternoon, some of the adults who were showing up wandered over to examine the monstrosity.
zh_cn: 整个下午都有一些小青年过来围着这条大得吓人的东西转。

source: Among them was an older boy, Jack, a 15-year-old who had been kicked out of school the year before for fighting.
zh_cn: 他们当中有个年纪较大的，叫杰克，15岁了，头一年因为打架被踢出了校门。

source: Jack waited until no adults were around and then came by and said that he wanted the fish, that it was his father's - that his father had been the one who had caught it - and that he would give me five dollars if I would let him have it.
zh_cn: 杰克等那些小青年都离开后，走了过来，向我要这条鱼，他说这条鱼是他爸爸的，是他爸爸抓到这条鱼的，如果我把鱼给他，他愿意付5美元。

source: "No," I said, "my father told me to take care of it."
zh_cn: “不，”我说，“我爸跟我说了，要我看好它。”

source: Jack had me figured straightaway for a Goody Two-Shoes.
zh_cn: 杰克直白地说我是一个伪君子。

source: "They're just going to kill it," he said.
zh_cn: “他们会杀了它的”，他说，

source: "It's mine.
zh_cn: “这鱼是我的。

source: Give it to me and I'll let it go.
zh_cn: 给我，我好把它放了。

source: I swear I will," he said.
zh_cn: 骗你不是人。”

source: "Give it to me or I'll beat you up."
zh_cn: 他还说，“把它给我，否则我揍你。”

source: As if intuiting or otherwise discerning trouble - though trouble followed Jack, and realizing that did not require much prescience - my father appeared from around the corner, and asked us how everything was going.
zh_cn: 我爸或许是因为直觉，或许是他看到杰克在找我麻烦，这不用多想就能知道，他从角落里走了出来，问我一切可好。

source: Jack, scowling but saying nothing, tipped his cap at the fish but not at my father or me, and walked away.
zh_cn: 杰克皱着眉头，一声不吭，用他戴的帽子指了指鱼，但没有指我和爸爸，就走开了。

source: "What did he want?" my father asked.
zh_cn: “他想要干嘛？”我爸问道。

source: "Nothing," I said. "He was just looking at the fish."
zh_cn: “没什么”，我说，“他只是来看看鱼。”

source: I knew that if I told on Jack and he got in trouble, I would get pummeled.
zh_cn: 我知道我要是把刚才的事说出来的话，杰克就会有麻烦了，而我也会挨揍了。

source: "Did he say it was his fish?" my father asked. "Was he trying to claim it?"
zh_cn: “他是不是说这条鱼是他的？”我爸问道，“他想把鱼要回去，是吗？”

source: "I think he said his father caught it."
zh_cn: “我想他说这鱼是他爸抓到的吧。”

source: "His father owes us $67," my father said. "He gave me the fish instead.
zh_cn: “他爸欠了我们67美元，”我爸说到，“用这条鱼来抵。

source: Don't let Jack take that fish back."
zh_cn: 不要让杰克把鱼抢走了。”

source: "I won't," I said.
zh_cn: “好的”，我回答说。

source: I can't remember if I've mentioned that, while not poor, we were right at the edge of poor.
zh_cn: 我不记得我是否说过，我们家不是穷，而是穷得揭不开锅了。

source: THE DUSTY ORANGE sky faded to the cool purple-blue of dusk.
zh_cn: 灰蒙蒙的橙色天空淡了下来，显出了凉爽的紫蓝色黄昏。

source: Stars appeared and fireflies emerged from the grass.
zh_cn: 星星出来了，草地上的萤火虫也出来了。

source: I watched them, and listened to the drum and groan of the bullfrogs in the stock tank in the field below, and to the bellowing of the cattle.
zh_cn: 我看着星星和萤火虫，听着田野下水库边的鼓响、蛙鸣、牛吼。

source: I kept watering the fish, and the fish kept watching me, with its gasps coming harder.
zh_cn: 我一直用水浇着鱼，鱼也一直盯着我，呼吸越来越困难。

source: From time to time I saw Jack loitering, but he didn't come back over to where I was.
zh_cn: 我时不时地看到杰克晃来晃去，但他没有来我这儿。

source: Later in the evening, before dark, but only barely, a woman I thought was probably Jack's mother - I had seen her talking to him - came walking over and crouched beside me.
zh_cn: 到了傍晚，但天还没完全黑，一个女人只身一人走了过来，蹲在我的身旁，我想这个女人可能就是杰克的妈妈，我看到了她和杰克说话。

source: She was dressed as if for a party of far greater celebration than ours, with sequins on her dress, and flat leather sandals.
zh_cn: 看她的打扮好像是要参加一个晚会，一个远比我们所举办的要盛大得多的晚会，她穿着亮片闪闪的连衣裙，一双平底的皮凉鞋。

source: Her toenails were painted bright red, but her pale feet were speckled with dust, as if she had been walking a long time.
zh_cn: 她脚趾甲涂得鲜红，但白皙的脚上尘土点点，好像走了很长时间的路。

source: I could smell the whiskey on her breath, and on her clothes, I thought, and I hoped she would not try to engage me in conversation, though such was not to be my fortune.
zh_cn: 在她的呼吸中，在她的衣服上，我都能闻到威士忌酒的酒气，我想但愿她不要与我搭讪，尽管这样想并不现实。

source: "Thass a big fish," she said.
zh_cn: “这条鱼很大，”她说。

source: "Yes, ma'am," I said, quietly.
zh_cn: “是的，太太，”我低声地说道。

source: I dreaded that she was going to ask for the fish back.
zh_cn: 我害怕她会向我要去这条鱼。

source: "My boy and my old man caught that fish," she said. "You'll see. Gonna have their pictures in the newspaper."
zh_cn: “我的儿子和老公抓住了这条鱼，”她说，“你看，报纸上会登他们的照片。”

source: She paused, descending into some distant, nether reverie, and stared at the fish as if in labored communication with it.
zh_cn: 她停顿了一下，陷入了遥远的冥冥遐想之中，盯着鱼，仿佛在和它苦苦交谈。

source: "That fish is prolly worth a lot of money, you know?" she said.
zh_cn: “这条鱼可能值很多钱，你知道吗？”她说。

source: I didn't say anything.
zh_cn: 我什么都没说。

source: Her diction and odor were such that I would not take my first sip of alcohol until I was 22.
zh_cn: 她的发音吐词和气味就像我22岁那年啜了第一口酒那样。

source: Out in the field, my father was busy lighting the bonfire.
zh_cn: 远处的田野上，我爸正忙着点燃篝火。

source: A distant whoosh, a pyre of light, went up.
zh_cn: 远处呼地一声，柴堆点燃了，升起了亮光。

source: The drunk woman turned her head slowly, studied the sight with incomprehension, then said, slowly, "Wooo!"
zh_cn: 那个喝醉了的女人把头慢慢转过去，端详着这光景，满脸疑惑，慢慢地说了声“喔！”。

source: Then she turned her attention back to what she clearly thought was still her fish.
zh_cn: 然后她又把注意力转到了她记得一清二楚的那条鱼身上。

source: She reached out an unsteady hand and touched the fish on its broad back, partly as if to reestablish ownership, and partly to keep from pitching over into the mud.
zh_cn: 她伸出颤抖的手，摸着大鱼那宽阔的背脊，仿佛宣告她是鱼的主人，又仿佛是扶一扶以免贴到泥地上。

source: She had no guile about her; the liquor had opened her mind.
zh_cn: 她没有心机，酒精已经把她的想法暴露无遗。

source: I could see she was thinking about gripping the fish's toothy jaw and dragging it away, though to where, I could not imagine.
zh_cn: 我明白她正在想如何握住鱼那露齿的下颚，把鱼拖走。但她想把鱼拖到哪儿，我就想不到了。

source: As if, given a second chance at wealth and power, she would not squander it. As if this fish was the greatest luck that had happened to them in ages.
zh_cn: 这就好像她有第二次机会获得财富和权力，是不会错过的，这鱼就好像是她们这些上了年纪的人碰到的最好运气。

source: "You don't talk much, do you?" she asked.
zh_cn: “你不太爱说话，是吧？”她问道。

source: Wobbling even in her sandals, hunkered there.
zh_cn: 尽管穿着凉鞋蹲着，但还是摇摇晃晃。

source: "No, ma'am."
zh_cn: “是的，太太。”

source: "You know my boy?"
zh_cn: “你认识我儿子吗？”

source: "Yes, ma'am."
zh_cn: “认识，太太。”

source: "Do you think your father was right to take this fish from us?
zh_cn: “你觉得你爸把鱼从我们那儿拿走，对吗？

source: Do you think this fish is worth any piddling $67?"
zh_cn: 你认为这条鱼就值这小小的67美元，是吗？”

source: I knew that anything I said would ignite her, would send her off on some tangent of rage and pity.
zh_cn: 我知道我只要一开口就会激怒她，就会让她怀着一丝愤懑和遗憾而去。

source: "I'm gonna go get my boy," she said, turning and staring in the direction of the fire.
zh_cn: “我要......要去找我的儿子去了，”她说着，转身盯着篝火燃烧的方向。

source: Dusk was gone, the fire was bright in the night.
zh_cn: 黄昏已经远去了，篝火在夜里很明亮。

source: She rose, stumbled, fell in the mud, cursed, and labored to her feet, then wandered off into the dark, away from the fish, and away from the fire.
zh_cn: 她摇摇晃晃地站起来，可跌倒在泥地上，于是骂骂咧咧，吃力地站起来，最后晃晃荡荡地走进黑暗之中，离开了那条鱼，离开了那篝火。

source: As if she lived in the darkness, had some secret sanctuary there.
zh_cn: 她仿佛就住在黑暗中，在那里她有一个隐秘的避难所。

source: I kept watering the fish.
zh_cn: 我不停地给鱼浇水。

source: The gasps were coming slower and I felt that perhaps a fire was going out in the fish's eyes.
zh_cn: 鱼的呼吸越来越缓慢。我发觉篝火的火星似乎迸进了鱼的眼睛。

source: Lanterns were lit, and moths rose from the fields and swarmed those lanterns.
zh_cn: 灯笼已经点亮了，飞蛾从田野里飞起，成群地围着灯笼。

source: Men came over and began to place the lanterns on the ground all around the fish, like candelabra at a dinner setting.
zh_cn: 男人们走了过来，开始围着这条鱼把灯笼摆到地上，就像布置晚餐的烛台一样。

source: I hoped that the fish would die before they began skinning it.
zh_cn: 我希望鱼在被剥皮之前已经死去。

source: Moths cartwheeled off the lantern glass, wing-singed, sometimes aflame - like poor, crude, awkward imitations of the fireflies - and landed fuzz-busted on the catfish's glistening back, where they stuck to its skin like feathers, their wings still trembling.
zh_cn: 玻璃灯罩里的飞蛾，有的双翼被烧掉，有的整个被烧掉，就像模仿萤火虫，但显得可怜、粗糙、笨拙。于是飞蛾沿着灯罩边飞了出来，双翼烧焦，落在了鲶鱼闪闪发光的脊背上，就像粘在鱼脊上的细毛，双翼还在颤抖。

source: A man's voice came from behind me, saying, "Hey, you're wasting water," and turned the hose off.
zh_cn: 突然，我身后传来一个男人的声音，“喂，别浪费水啦！”，同时水管被他给关了。

source: Immediately, or so it seemed to me, a fine wrinkling appeared on the previously taut gunmetal skin of the fish - a desiccation, like watching a time-lapse motion picture of a man's or woman's skin wrinkling as he or she ages, regardless of the man's or woman's wishes to the contrary.
zh_cn: 瞬间，至少我的感觉是这样，我看见这条鱼因干燥，先前紧紧的青铜色鱼皮上出现了细细的皱纹，就像看着一个男人或女人随着年龄的增长，皮肤变皱的情形在短时间内连续上演一样，尽管他们并不希望这样。

source: The heat from the lanterns seemed to be sucking the moisture from the skin.
zh_cn: 灯笼散发的热量似乎在吮吸着鱼皮上的湿气。

source: The fish's eyes seemed to search for mine.
zh_cn: 鱼的眼睛似乎在寻找我的目光。

source: The man who had turned off the water was Jack's father, and he was holding a Bowie knife.
zh_cn: 关掉水的那个男人是杰克的爸爸。他正拿着一把鲍伊猎刀。

source: My heart stopped, and I tried to tell him to take the fish, but found myself speechless.
zh_cn: 我的心一顿，想要他把鱼拿走，可是一句话也说不出来。

source: Jack's father's eyes were red-drunk also, and he wavered in such a manner as to seem in danger of falling over onto the dagger he gripped.
zh_cn: 杰克他爸的眼睛也因醉酒而红通通的，走起路来晃晃悠悠，身体往前倾，很有可能倒向自己紧握着那把刀的刀尖上。

source: He beheld the fish for long moments.
zh_cn: 他看了那条鱼好半天。

source: "Clarebelle wants me to take the fish home," he said, and seemed to be studying the logistics of such a command.
zh_cn: “克莱尔贝尔叫我把鱼拿回家去，”他一边说着，一边似乎还在琢磨这样的指令是否合乎逻辑。

source: "Shit," he said, "I ain't takin' no fish home.
zh_cn: “狗屁”，他叫道，“拿什么鱼回去。

source: Fuck her," he said.
zh_cn: 他妈的。”

source: "I pay my debts."
zh_cn: “我要还债。”

source: He crouched beside the fish and made his first cut lightly around the fish's wide neck with the long blade as if opening an envelope.
zh_cn: 他蹲在鱼的旁边，用长长的刀锋在宽阔的鱼颈处轻轻地开了第一刀，就像开信封一样。

source: He slid the knife in lengthwise beneath the skin and then ran a straight incision down the spine all the way to the tail, four feet distant.
zh_cn: 他用刀在鱼皮底纵向划过，从鱼脊到鱼尾一路划下去，划了四英尺长。

source: The fish stopped gasping for a moment, opened its giant mouth in shock and outrage, then began to gasp louder.
zh_cn: 鱼一时间停止了呼吸，震惊地张开硕大的嘴巴，愤怒不已，接着大声喘着粗气。

source: In watering the fish all day, and into the evening, I had not noticed how many men and women had been gathering.
zh_cn: 由于从早到晚一整天我都在给鱼淋水，因此没有留意有多少男男女女聚集在这儿。

source: Now when I straightened up to stretch, I saw that several of them had left the fire and come over to view the fish - could the fish, like a small whale, feed them all- and that most of them were drinking.
zh_cn: 现在我可以站起来伸伸懒腰了，这时我看到有几个人已经离开篝火走向这边来看鱼，看这条像小鲸鱼一样的大鱼是否够分，过来看鱼的人大部分都醉醺醺的。

source: "Someone put that fish out of its misery," a woman said, and a man stepped from out of the crowd with a pistol, aimed it at the fish's broad head, and fired.
zh_cn: “得有人结束这条鱼的痛苦，”一个女人说道，于是一个男人从人群中走了出来，拿了支手枪，瞄准宽大的鱼头开了一枪。

source: My father came hurrying over from the fire, shouted, "Stop shooting, dammit," and the man grumbled an apology and retreated into the crowd.
zh_cn: 听到枪声后，父亲匆忙从篝火那赶了过来，大声喊到：“该死的，不要开枪！”那开枪的男子嘟嘟囔囔地道了个歉，回到了人群中。

source: The bullet had made a dark hole in the fish's head.
zh_cn: 子弹在鱼头上留下了一个黑洞。

source: The wound didn't bleed, and the fish, like some mythic monster, did not seem affected by it.
zh_cn: 伤口处并没有流血，鱼就像一个神秘的怪兽，似乎没有受到影响。

source: It kept on breathing, and I wanted very much to begin watering it again.
zh_cn: 鱼继续呼吸，我真想再往它身上淋水。

source: Jack's father had paused only slightly during the shooting, and now kept cutting.
zh_cn: 当别人在朝鱼开枪时，杰克的爸爸只中途稍稍停了一会，此刻仍继续在鱼身上切划。

source: When he had all the cuts made, two other men helped him lift the fish.
zh_cn: 当他切完之后，另外两个男人帮他抬起了鱼。

source: They ran a rope through its mouth and out its gills and hoisted it into a tree, where roosting night birds rustled in alarm, then flew into the night.
zh_cn: 他们用一根绳子从鱼嘴穿入，从鱼鳃穿出，然后把鱼挂到树上。这时惊动了夜间在树上栖息的鸟儿，一阵沙沙作响过后，鸟儿飞向了夜空。

source: The fish writhed, sucked for air, and, finding none, was somehow from far within able to find, summon, and deliver enough power to flap its tail once, slapping one of the men in the ribs with a thwack!
zh_cn: 那鱼拼命翻腾，吮吸着空气，可吸不到任何空气，它已经毫无办法呼唤，它使出浑身力量，摆动鱼尾，朝那些男人的肋骨上猛地一击。
